
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	
	ВКМ_ВидимостьЭдлементовФормы();
	
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура ВКМ_ПриОткрытии(Отказ)
	
	ВКМ_ВидимостьЭдлементовФормы();
		
КонецПроцедуры    

Процедура ВКМ_ВидимостьЭдлементовФормы()
	
	Видимость = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость 		= Видимость;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость 	= Видимость;
	Элементы.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Видимость;
	Элементы.ВКМ_СтоимостьЧасаРабот.Видимость 				= Видимость;
	
КонецПроцедуры
