
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	ВКМ_Пларировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	ОбновитьПланировщик();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПланировщик()
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	Месяц = 2628000;
	
	ВКМ_Пларировщик.Элементы.Очистить();
	
	Заявки = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода - Месяц, КонецПериода + Месяц);
	
	Пока Заявки.Следующий() Цикл 
		
		НачалоЗаявки = Заявки.ВКМ_ДатаПроведенияРабот + (Заявки.ВКМ_ВремяНачалаРабот - Дата(1,1,1));
		КонецЗаявки = Заявки.ВКМ_ДатаПроведенияРабот + (Заявки.ВКМ_ВремяОкончанияРабот - Дата(1,1,1));
		
		ЭлементПланировщика = ВКМ_Пларировщик.Элементы.Добавить(НачалоЗаявки, КонецЗаявки);
		ЭлементПланировщика.Значение = Заявки.Ссылка;
		ЭлементПланировщика.Текст = Заявки.ВКМ_Специалист; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда) 
	
	ОбновитьПланировщик();     
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ПларировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура; 
	ЗначенияЗаполнения.Вставить("Дата", ТекущаяДата()); 
	ЗначенияЗаполнения.Вставить("ВКМ_ДатаПроведенияРабот", НачалоДня(Начало));
	ЗначенияЗаполнения.Вставить("ВКМ_ВремяНачалаРабот", Дата(1,1,1) + (Начало - НачалоДня(Начало))); 
	ЗначенияЗаполнения.Вставить("ВКМ_ВремяОкончанияРабот", Дата(1,1,1) + (Конец - НачалоДня(Конец)));
	ЗначенияЗаполнения.Вставить("ВКМ_Специалист", ПользователиКлиент.ТекущийПользователь());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВКМ_ОбслуживаниеКлиента" Тогда 
		ОбновитьПланировщик();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ПларировщикПриАктивизации(Элемент)  
	
	ДокСсылка = Элемент.ВыделенныеЭлементы[0].Значение; 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ДокСсылка);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры
