
#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда  
		
		Если Форма.Элементы.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_ВидыДоговоровКонтрагентов Тогда
			ДобавитьПоляПериодСуммаСтоимость(Форма);	
		КонецЕсли;		
		
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		ДобавитьКнопкуЗаполнить(Форма);  
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ДобавитьПоляПериодСуммаСтоимость(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Добавить("ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	ПолеВвода = Форма.Элементы.Добавить("ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	
	ПолеВвода = Форма.Элементы.Добавить("СуммаЕжемесячнойАбоненсткойПлаты", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты";
	
	ПолеВвода = Форма.Элементы.Добавить("СтоимостьЧасаРабот", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРабот";
	
КонецПроцедуры 

Процедура ДобавитьКнопкуЗаполнить(Форма)

	НоваяКнопка = Форма.Команды.Добавить("ВКМ_Заполнить");
	НоваяКнопка.Заголовок = "Заполнить";
	НоваяКнопка.Действие = "ВКМ_Заполнить";
		
	Кнопка = Форма.Элементы.Добавить("ВКМ_Заполнить", Тип("КнопкаФормы"), Форма.КоманднаяПанель);
	Кнопка.ИмяКоманды = "ВКМ_Заполнить";
	
КонецПроцедуры


#КонецОбласти
