
Функция  СоздатьДокументыНаСервере(Период) Экспорт 
	
	МассивДокИДог = ВКМ_ПолучитьДоговорыИРеализации(Период);
	
	МассивДляТЧ = Новый Массив;
	
	Для Каждого СтрокаМассива Из МассивДокИДог Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаМассива.РеализацияТоваровУслуг) Тогда 
			
			МассивДляТЧ.Добавить(Новый Структура("Договор, Реализация", СтрокаМассива.Договор, ВКМ_СоздатьНовыйДокРеализации(СтрокаМассива)));
			Продолжить;
			
		КонецЕсли;
		
		МассивДляТЧ.Добавить(Новый Структура("Договор, Реализация", СтрокаМассива.Договор, СтрокаМассива.РеализацияТоваровУслуг));
		
	КонецЦикла;
	
	Возврат МассивДляТЧ;
	
КонецФункции

Функция  ВКМ_ПолучитьДоговорыИРеализации(Период) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Договоры
	               |ПОМЕСТИТЬ вт_Договоры
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &Период
	               |	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &Период
	               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ вт_Реализация
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	               |	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
	               |	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт_Договоры.Договоры.Ссылка КАК Договор,
	               |	вт_Реализация.Ссылка КАК РеализацияТоваровУслуг
	               |ИЗ
	               |	вт_Договоры КАК вт_Договоры
	               |		ПОЛНОЕ СОЕДИНЕНИЕ вт_Реализация КАК вт_Реализация
	               |		ПО вт_Договоры.Договоры.Ссылка = вт_Реализация.Ссылка.Договор.Ссылка";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ВКМ_СоздатьНовыйДокРеализации(СтрокаМассива)

	НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДок.Организация = СтрокаМассива.Договор.Организация;
	НовыйДок.Контрагент = СтрокаМассива.Договор.Владелец;
	НовыйДок.Договор = СтрокаМассива.Договор;
	НовыйДок.Дата = ТекущаяДата(); 
	НовыйДок.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	НовыйДок.Комментарий = "Этот документ создан групповой обработкой.";
	НовыйДок.ВКМ_ВыполнитьАвтозаполнение();
	НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НовыйДок.Ссылка;

КонецФункции

Процедура ВКМ_ДобавитьСтрокуВТЧ(Договор, Реализация, ТЧ) Экспорт
	
	НоваяСтрокаТБ = ТЧ.Добавить();
	НоваяСтрокаТБ.ВКМ_Договоры = Договор;
	НоваяСтрокаТБ.ВКМ_РеализацияТоваровУслуг = Реализация;
	
КонецПроцедуры
